## staging: newrelic
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 18 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                             NAME                                              |
|--------|-----------------------------------------------------------------------------------------------|
| add    | `newrelic_alert_policy.terraform_notify_policy[0]`                                            |
|        | `newrelic_notification_channel.terraform_notify_channel[0]`                                   |
|        | `newrelic_notification_destination.terraform_notify_destination[0]`                           |
|        | `newrelic_nrql_alert_condition.admin_error_percentage[0]`                                     |
|        | `newrelic_nrql_alert_condition.admin_response_time[0]`                                        |
|        | `newrelic_nrql_alert_condition.external_services_callbacks_over_5_seconds_duration[0]`        |
|        | `newrelic_nrql_alert_condition.internal_services_awsnotify_over_5_seconds_duration[0]`        |
|        | `newrelic_nrql_alert_condition.k8s_api_error_percentage[0]`                                   |
|        | `newrelic_nrql_alert_condition.k8s_api_response_time[0]`                                      |
|        | `newrelic_nrql_alert_condition.k8s_api_transaction_database_time[0]`                          |
|        | `newrelic_nrql_alert_condition.lambda_api_error_count_anomaly_fuzzy_attack[0]`                |
|        | `newrelic_nrql_alert_condition.lambda_api_error_percentage_api_user_errors[0]`                |
|        | `newrelic_nrql_alert_condition.lambda_api_error_percentage_fuzzy_attack[0]`                   |
|        | `newrelic_nrql_alert_condition.lambda_api_error_percentage_fuzzy_attack_anomaly_detection[0]` |
|        | `newrelic_nrql_alert_condition.lambda_api_error_percentage_unexpected_errors[0]`              |
|        | `newrelic_nrql_alert_condition.lambda_api_errors_count_anomaly_api_user_errors[0]`            |
|        | `newrelic_nrql_alert_condition.lambda_api_errors_count_anomaly_unexpected_errors[0]`          |
|        | `newrelic_workflow.terraform_notify_workflow[0]`                                              |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/notification-terraform/actions/runs/17836361009).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
17:21:05.958 STDOUT terraform:   + create
17:21:05.958 STDOUT terraform: Terraform will perform the following actions:
17:21:05.958 STDOUT terraform:   # newrelic_alert_policy.terraform_notify_policy[0] will be created
17:21:05.958 STDOUT terraform:   + resource "newrelic_alert_policy" "terraform_notify_policy" {
17:21:05.959 STDOUT terraform:       + account_id          = (known after apply)
17:21:05.959 STDOUT terraform:       + id                  = (known after apply)
17:21:05.959 STDOUT terraform:       + incident_preference = "PER_POLICY"
17:21:05.959 STDOUT terraform:       + name                = "Notify Policy - staging"
17:21:05.959 STDOUT terraform:     }
17:21:05.959 STDOUT terraform:   # newrelic_notification_channel.terraform_notify_channel[0] will be created
17:21:05.959 STDOUT terraform:   + resource "newrelic_notification_channel" "terraform_notify_channel" {
17:21:05.959 STDOUT terraform:       + account_id     = (known after apply)
17:21:05.959 STDOUT terraform:       + active         = true
17:21:05.959 STDOUT terraform:       + destination_id = (known after apply)
17:21:05.959 STDOUT terraform:       + id             = (known after apply)
17:21:05.959 STDOUT terraform:       + name           = "Notify Slack Channel - staging"
17:21:05.959 STDOUT terraform:       + product        = "IINT"
17:21:05.959 STDOUT terraform:       + status         = (known after apply)
17:21:05.959 STDOUT terraform:       + type           = "SLACK_LEGACY"
17:21:05.959 STDOUT terraform:       + property {
17:21:05.959 STDOUT terraform:           + key           = "payload"
17:21:05.959 STDOUT terraform:           + label         = "Payload Template"
17:21:05.959 STDOUT terraform:           + value         = jsonencode({})
17:21:05.959 STDOUT terraform:             # (1 unchanged attribute hidden)
17:21:05.959 STDOUT terraform:         }
17:21:05.959 STDOUT terraform:     }
17:21:05.959 STDOUT terraform:   # newrelic_notification_destination.terraform_notify_destination[0] will be created
17:21:05.959 STDOUT terraform:   + resource "newrelic_notification_destination" "terraform_notify_destination" {
17:21:05.959 STDOUT terraform:       + account_id = (sensitive value)
17:21:05.959 STDOUT terraform:       + active     = true
17:21:05.959 STDOUT terraform:       + guid       = (known after apply)
17:21:05.960 STDOUT terraform:       + id         = (known after apply)
17:21:05.960 STDOUT terraform:       + last_sent  = (known after apply)
17:21:05.960 STDOUT terraform:       + name       = "Notify Slack Destination - staging"
17:21:05.960 STDOUT terraform:       + status     = (known after apply)
17:21:05.960 STDOUT terraform:       + type       = "SLACK_LEGACY"
17:21:05.960 STDOUT terraform:       + property {
17:21:05.960 STDOUT terraform:           # At least one attribute in this block is (or was) sensitive,
17:21:05.960 STDOUT terraform:           # so its contents will not be displayed.
17:21:05.960 STDOUT terraform:         }
17:21:05.960 STDOUT terraform:     }
17:21:05.960 STDOUT terraform:   # newrelic_nrql_alert_condition.admin_error_percentage[0] will be created
17:21:05.960 STDOUT terraform:   + resource "newrelic_nrql_alert_condition" "admin_error_percentage" {
17:21:05.960 STDOUT terraform:       + account_id                   = (sensitive value)
17:21:05.960 STDOUT terraform:       + aggregation_delay            = "120"
17:21:05.960 STDOUT terraform:       + aggregation_method           = "event_flow"
17:21:05.960 STDOUT terraform:       + aggregation_window           = 60
17:21:05.960 STDOUT terraform:       + enabled                      = false
17:21:05.960 STDOUT terraform:       + entity_guid                  = (known after apply)
17:21:05.960 STDOUT terraform:       + fill_option                  = "static"
17:21:05.960 STDOUT terraform:       + fill_value                   = 0
17:21:05.960 STDOUT terraform:       + id                           = (known after apply)
17:21:05.960 STDOUT terraform:       + name                         = "[Admin] Error percentage"
17:21:05.960 STDOUT terraform:       + policy_id                    = (known after apply)
17:21:05.960 STDOUT terraform:       + type                         = "static"
17:21:05.960 STDOUT terraform:       + violation_time_limit         = (known after apply)
17:21:05.960 STDOUT terraform:       + violation_time_limit_seconds = 259200
17:21:05.961 STDOUT terraform:       + critical {
17:21:05.961 STDOUT terraform:           + disable_health_status_reporting = false
17:21:05.961 STDOUT terraform:           + operator                        = "above"
17:21:05.961 STDOUT terraform:           + threshold                       = 1
17:21:05.961 STDOUT terraform:           + threshold_duration              = 300
17:21:05.961 STDOUT terraform:           + threshold_occurrences           = "all"
17:21:05.961 STDOUT terraform:         }
17:21:05.961 STDOUT terraform:       + nrql {
17:21:05.961 STDOUT terraform:           + data_account_id = (known after apply)
17:21:05.961 STDOUT terraform:           + query           = "SELECT ((filter(count(newrelic.timeslice.value), where metricTimesliceName = 'Errors/all') / filter(count(newrelic.timeslice.value), WHERE metricTimesliceName IN ('HttpDispatcher', 'OtherTransaction/all'))) OR 0) * 100 FROM Metric WHERE appId IN (511399580) AND metricTimesliceName IN ('Errors/all', 'HttpDispatcher', 'OtherTransaction/all', 'Agent/MetricsReported/count') FACET appId"
17:21:05.961 STDOUT terraform:         }
17:21:05.961 STDOUT terraform:       + warning {
17:21:05.961 STDOUT terraform:           + disable_health_status_reporting = false
17:21:05.961 STDOUT terraform:           + operator                        = "above"
17:21:05.961 STDOUT terraform:           + threshold                       = 0.5
17:21:05.961 STDOUT terraform:           + threshold_duration              = 600
17:21:05.961 STDOUT terraform:           + threshold_occurrences           = "all"
17:21:05.961 STDOUT terraform:         }
17:21:05.961 STDOUT terraform:     }
17:21:05.961 STDOUT terraform:   # newrelic_nrql_alert_condition.admin_response_time[0] will be created
17:21:05.961 STDOUT terraform:   + resource "newrelic_nrql_alert_condition" "admin_response_time" {
17:21:05.962 STDOUT terraform:       + account_id                   = (sensitive value)
17:21:05.962 STDOUT terraform:       + aggregation_delay            = "120"
17:21:05.962 STDOUT terraform:       + aggregation_method           = "event_flow"
17:21:05.962 STDOUT terraform:       + aggregation_window           = 60
17:21:05.962 STDOUT terraform:       + enabled                      = false
17:21:05.962 STDOUT terraform:       + entity_guid                  = (known after apply)
17:21:05.962 STDOUT terraform:       + fill_option                  = "static"
17:21:05.962 STDOUT terraform:       + fill_value                   = 0
17:21:05.962 STDOUT terraform:       + id                           = (known after apply)
17:21:05.962 STDOUT terraform:       + name                         = "[Admin] Response time"
17:21:05.962 STDOUT terraform:       + policy_id                    = (known after apply)
17:21:05.962 STDOUT terraform:       + type                         = "static"
17:21:05.962 STDOUT terraform:       + violation_time_limit         = (known after apply)
17:21:05.962 STDOUT terraform:       + violation_time_limit_seconds = 259200
17:21:05.962 STDOUT terraform:       + critical {
17:21:05.962 STDOUT terraform:           + disable_health_status_reporting = false
17:21:05.962 STDOUT terraform:           + operator                        = "above"
17:21:05.962 STDOUT terraform:           + threshold                       = 0.5
17:21:05.962 STDOUT terraform:           + threshold_duration              = 300
17:21:05.962 STDOUT terraform:           + threshold_occurrences           = "all"
17:21:05.962 STDOUT terraform:         }
17:21:05.962 STDOUT terraform:       + nrql {
17:21:05.962 STDOUT terraform:           + data_account_id = (known after apply)
17:21:05.962 STDOUT terraform:           + query           = "SELECT filter(average(newrelic.timeslice.value), WHERE metricTimesliceName = 'HttpDispatcher') OR 0 FROM Metric WHERE appId IN (511399580) AND metricTimesliceName IN ('HttpDispatcher', 'Agent/MetricsReported/count') FACET appId"
17:21:05.962 STDOUT terraform:         }
17:21:05.962 STDOUT terraform:       + warning {
17:21:05.962 STDOUT terraform:           + disable_health_status_reporting = false
17:21:05.962 STDOUT terraform:           + operator                        = "above"
17:21:05.962 STDOUT terraform:           + threshold                       = 0.2
17:21:05.962 STDOUT terraform:           + threshold_duration              = 600
17:21:05.962 STDOUT terraform:           + threshold_occurrences           = "all"
17:21:05.962 STDOUT terraform:         }
17:21:05.962 STDOUT terraform:     }
17:21:05.962 STDOUT terraform:   # newrelic_nrql_alert_condition.external_services_callbacks_over_5_seconds_duration[0] will be created
17:21:05.963 STDOUT terraform:   + resource "newrelic_nrql_alert_condition" "external_services_callbacks_over_5_seconds_duration" {
17:21:05.963 STDOUT terraform:       + account_id                   = (sensitive value)
17:21:05.963 STDOUT terraform:       + aggregation_delay            = "120"
17:21:05.963 STDOUT terraform:       + aggregation_method           = "event_flow"
17:21:05.963 STDOUT terraform:       + aggregation_window           = 60
17:21:05.963 STDOUT terraform:       + description                  = (sensitive value)
17:21:05.963 STDOUT terraform:       + enabled                      = false
17:21:05.963 STDOUT terraform:       + entity_guid                  = (known after apply)
17:21:05.963 STDOUT terraform:       + id                           = (known after apply)
17:21:05.963 STDOUT terraform:       + name                         = "[External Services / Callbacks] Over 5 seconds duration"
17:21:05.963 STDOUT terraform:       + policy_id                    = (known after apply)
17:21:05.963 STDOUT terraform:       + type                         = "static"
17:21:05.963 STDOUT terraform:       + violation_time_limit         = (known after apply)
17:21:05.963 STDOUT terraform:       + violation_time_limit_seconds = 3600
17:21:05.963 STDOUT terraform:       + critical {
17:21:05.963 STDOUT terraform:           + disable_health_status_reporting = false
17:21:05.963 STDOUT terraform:           + operator                        = "above"
17:21:05.963 STDOUT terraform:           + threshold                       = 10
17:21:05.963 STDOUT terraform:           + threshold_duration              = 60
17:21:05.963 STDOUT terraform:           + threshold_occurrences           = "all"
17:21:05.963 STDOUT terraform:         }
17:21:05.963 STDOUT terraform:       + nrql {
17:21:05.963 STDOUT terraform:           + data_account_id = (known after apply)
17:21:05.963 STDOUT terraform:           + query           = "SELECT max(duration) FROM Span WHERE service.name like 'notification-celery-staging' AND http.url IS NOT NULL AND http.url not like '%amazonaws.com%' AND http.url not like '%notification.canada.ca%' AND name like 'External%' facet http.url"
17:21:05.963 STDOUT terraform:         }
17:21:05.963 STDOUT terraform:     }
17:21:05.963 STDOUT terraform:   # newrelic_nrql_alert_condition.internal_services_awsnotify_over_5_seconds_duration[0] will be created
17:21:05.963 STDOUT terraform:   + resource "newrelic_nrql_alert_condition" "internal_services_awsnotify_over_5_seconds_duration" {
17:21:05.963 STDOUT terraform:       + account_id                   = (sensitive value)
17:21:05.963 STDOUT terraform:       + aggregation_delay            = "120"
17:21:05.963 STDOUT terraform:       + aggregation_method           = "event_flow"
17:21:05.963 STDOUT terraform:       + aggregation_window           = 60
17:21:05.963 STDOUT terraform:       + description                  = (sensitive value)
17:21:05.963 STDOUT terraform:       + enabled                      = false
17:21:05.963 STDOUT terraform:       + entity_guid                  = (known after apply)
17:21:05.963 STDOUT terraform:       + id                           = (known after apply)
17:21:05.963 STDOUT terraform:       + name                         = "[Internal Services / AWS+Notify] Over 5 seconds duration"
17:21:05.963 STDOUT terraform:       + policy_id                    = (known after apply)
17:21:05.963 STDOUT terraform:       + type                         = "static"
17:21:05.964 STDOUT terraform:       + violation_time_limit         = (known after apply)
17:21:05.964 STDOUT terraform:       + violation_time_limit_seconds = 86400
17:21:05.964 STDOUT terraform:       + critical {
17:21:05.964 STDOUT terraform:           + disable_health_status_reporting = false
17:21:05.964 STDOUT terraform:           + operator                        = "above"
17:21:05.964 STDOUT terraform:           + threshold                       = 10
17:21:05.964 STDOUT terraform:           + threshold_duration              = 60
17:21:05.964 STDOUT terraform:           + threshold_occurrences           = "all"
17:21:05.964 STDOUT terraform:         }
17:21:05.964 STDOUT terraform:       + nrql {
17:21:05.964 STDOUT terraform:           + data_account_id = (known after apply)
17:21:05.964 STDOUT terraform:           + query           = "SELECT max(duration) FROM Span WHERE service.name like 'notification-celery-staging' AND http.url IS NOT NULL AND (http.url like '%amazonaws.com%' OR http.url like '%notification.canada.ca%') AND name like 'External%' facet http.url"
17:21:05.964 STDOUT terraform:         }
17:21:05.964 STDOUT terraform:     }
17:21:05.964 STDOUT terraform:   # newrelic_nrql_alert_condition.k8s_api_error_percentage[0] will be created
17:21:05.964 STDOUT terraform:   + resource "newrelic_nrql_alert_condition" "k8s_api_error_percentage" {
17:21:05.964 STDOUT terraform:       + account_id                   = (sensitive value)
17:21:05.964 STDOUT terraform:       + aggregation_delay            = "120"
17:21:05.964 STDOUT terraform:       + aggregation_method           = "event_flow"
17:21:05.964 STDOUT terraform:       + aggregation_window           = 60
17:21:05.964 STDOUT terraform:       + enabled                      = false
17:21:05.964 STDOUT terraform:       + entity_guid                  = (known after apply)
17:21:05.964 STDOUT terraform:       + fill_option                  = "static"
17:21:05.964 STDOUT terraform:       + fill_value                   = 0
17:21:05.964 STDOUT terraform:       + id                           = (known after apply)
17:21:05.964 STDOUT terraform:       + name                         = "[k8s API] Error percentage"
17:21:05.964 STDOUT terraform:       + policy_id                    = (known after apply)
17:21:05.964 STDOUT terraform:       + type                         = "static"
17:21:05.964 STDOUT terraform:       + violation_time_limit         = (known after apply)
17:21:05.964 STDOUT terraform:       + violation_time_limit_seconds = 259200
17:21:05.964 STDOUT terraform:       + critical {
17:21:05.964 STDOUT terraform:           + disable_health_status_reporting = false
17:21:05.964 STDOUT terraform:           + operator                        = "above"
17:21:05.964 STDOUT terraform:           + threshold                       = 2
17:21:05.964 STDOUT terraform:           + threshold_duration              = 300
17:21:05.964 STDOUT terraform:           + threshold_occurrences           = "all"
17:21:05.964 STDOUT terraform:         }
17:21:05.964 STDOUT terraform:       + nrql {
17:21:05.964 STDOUT terraform:           + data_account_id = (known after apply)
17:21:05.964 STDOUT terraform:           + query           = "SELECT ((filter(count(newrelic.timeslice.value), where metricTimesliceName = 'Errors/all') / filter(count(newrelic.timeslice.value), WHERE metricTimesliceName IN ('HttpDispatcher', 'OtherTransaction/all'))) OR 0) * 100 FROM Metric WHERE appId IN (511399611) AND metricTimesliceName IN ('Errors/all', 'HttpDispatcher', 'OtherTransaction/all', 'Agent/MetricsReported/count') FACET appId"
17:21:05.965 STDOUT terraform:         }
17:21:05.965 STDOUT terraform:       + warning {
17:21:05.965 STDOUT terraform:           + disable_health_status_reporting = false
17:21:05.965 STDOUT terraform:           + operator                        = "above"
17:21:05.965 STDOUT terraform:           + threshold                       = 1
17:21:05.965 STDOUT terraform:           + threshold_duration              = 300
17:21:05.965 STDOUT terraform:           + threshold_occurrences           = "all"
17:21:05.965 STDOUT terraform:         }
17:21:05.965 STDOUT terraform:     }
17:21:05.965 STDOUT terraform:   # newrelic_nrql_alert_condition.k8s_api_response_time[0] will be created
17:21:05.965 STDOUT terraform:   + resource "newrelic_nrql_alert_condition" "k8s_api_response_time" {
17:21:05.965 STDOUT terraform:       + account_id                   = (sensitive value)
17:21:05.965 STDOUT terraform:       + aggregation_delay            = "120"
17:21:05.965 STDOUT terraform:       + aggregation_method           = "event_flow"
17:21:05.965 STDOUT terraform:       + aggregation_window           = 60
17:21:05.965 STDOUT terraform:       + enabled                      = false
17:21:05.965 STDOUT terraform:       + entity_guid                  = (known after apply)
17:21:05.965 STDOUT terraform:       + fill_option                  = "static"
17:21:05.965 STDOUT terraform:       + fill_value                   = 0
17:21:05.965 STDOUT terraform:       + id                           = (known after apply)
17:21:05.965 STDOUT terraform:       + name                         = "[k8s API] Response time"
17:21:05.965 STDOUT terraform:       + policy_id                    = (known after apply)
17:21:05.965 STDOUT terraform:       + type                         = "static"
17:21:05.965 STDOUT terraform:       + violation_time_limit         = (known after apply)
17:21:05.965 STDOUT terraform:       + violation_time_limit_seconds = 259200
17:21:05.965 STDOUT terraform:       + critical {
17:21:05.965 STDOUT terraform:           + disable_health_status_reporting = false
17:21:05.965 STDOUT terraform:           + operator                        = "above"
17:21:05.965 STDOUT terraform:           + threshold                       = 0.1
17:21:05.965 STDOUT terraform:           + threshold_duration              = 300
17:21:05.965 STDOUT terraform:           + threshold_occurrences           = "all"
17:21:05.965 STDOUT terraform:         }
17:21:05.965 STDOUT terraform:       + nrql {
17:21:05.965 STDOUT terraform:           + data_account_id = (known after apply)
17:21:05.965 STDOUT terraform:           + query           = "SELECT filter(average(newrelic.timeslice.value), WHERE metricTimesliceName = 'HttpDispatcher') OR 0 FROM Metric WHERE appId IN (511399611) AND metricTimesliceName IN ('HttpDispatcher', 'Agent/MetricsReported/count') FACET appId"
17:21:05.965 STDOUT terraform:         }
17:21:05.965 STDOUT terraform:       + warning {
17:21:05.965 STDOUT terraform:           + disable_health_status_reporting = false
17:21:05.965 STDOUT terraform:           + operator                        = "above"
17:21:05.965 STDOUT terraform:           + threshold                       = 0.05
17:21:05.965 STDOUT terraform:           + threshold_duration              = 300
17:21:05.965 STDOUT terraform:           + threshold_occurrences           = "all"
17:21:05.965 STDOUT terraform:         }
17:21:05.965 STDOUT terraform:     }
17:21:05.965 STDOUT terraform:   # newrelic_nrql_alert_condition.k8s_api_transaction_database_time[0] will be created
17:21:05.966 STDOUT terraform:   + resource "newrelic_nrql_alert_condition" "k8s_api_transaction_database_time" {
17:21:05.966 STDOUT terraform:       + account_id                   = (sensitive value)
17:21:05.966 STDOUT terraform:       + aggregation_delay            = "120"
17:21:05.966 STDOUT terraform:       + aggregation_method           = "event_flow"
17:21:05.966 STDOUT terraform:       + aggregation_window           = 60
17:21:05.966 STDOUT terraform:       + baseline_direction           = "lower_only"
17:21:05.966 STDOUT terraform:       + enabled                      = false
17:21:05.966 STDOUT terraform:       + entity_guid                  = (known after apply)
17:21:05.966 STDOUT terraform:       + fill_option                  = "static"
17:21:05.966 STDOUT terraform:       + fill_value                   = 0
17:21:05.966 STDOUT terraform:       + id                           = (known after apply)
17:21:05.966 STDOUT terraform:       + name                         = "[k8s API] Transaction database time"
17:21:05.966 STDOUT terraform:       + policy_id                    = (known after apply)
17:21:05.966 STDOUT terraform:       + type                         = "baseline"
17:21:05.966 STDOUT terraform:       + violation_time_limit         = (known after apply)
17:21:05.966 STDOUT terraform:       + violation_time_limit_seconds = 259200
17:21:05.966 STDOUT terraform:       + critical {
17:21:05.966 STDOUT terraform:           + disable_health_status_reporting = false
17:21:05.966 STDOUT terraform:           + operator                        = "above"
17:21:05.966 STDOUT terraform:           + threshold                       = 2.81838
17:21:05.966 STDOUT terraform:           + threshold_duration              = 300
17:21:05.966 STDOUT terraform:           + threshold_occurrences           = "all"
17:21:05.966 STDOUT terraform:         }
17:21:05.966 STDOUT terraform:       + nrql {
17:21:05.966 STDOUT terraform:           + data_account_id = (known after apply)
17:21:05.966 STDOUT terraform:           + query           = "SELECT filter(average(newrelic.timeslice.value), WHERE metricTimesliceName = 'Datastore/all') OR 0 FROM Metric WHERE appId IN (511399611) AND metricTimesliceName IN ('Datastore/all', 'Agent/MetricsReported/count') FACET appId"
17:21:05.966 STDOUT terraform:         }
17:21:05.966 STDOUT terraform:       + warning {
17:21:05.966 STDOUT terraform:           + disable_health_status_reporting = false
17:21:05.966 STDOUT terraform:           + operator                        = "above"
17:21:05.966 STDOUT terraform:           + threshold                       = 2.81838
17:21:05.966 STDOUT terraform:           + threshold_duration              = 180
17:21:05.966 STDOUT terraform:           + threshold_occurrences           = "all"
17:21:05.966 STDOUT terraform:         }
17:21:05.966 STDOUT terraform:     }
17:21:05.966 STDOUT terraform:   # newrelic_nrql_alert_condition.lambda_api_error_count_anomaly_fuzzy_attack[0] will be created
17:21:05.966 STDOUT terraform:   + resource "newrelic_nrql_alert_condition" "lambda_api_error_count_anomaly_fuzzy_attack" {
17:21:05.966 STDOUT terraform:       + account_id                   = (sensitive value)
17:21:05.966 STDOUT terraform:       + aggregation_delay            = "300"
17:21:05.966 STDOUT terraform:       + aggregation_method           = "event_flow"
17:21:05.966 STDOUT terraform:       + aggregation_window           = 60
17:21:05.967 STDOUT terraform:       + baseline_direction           = "upper_and_lower"
17:21:05.967 STDOUT terraform:       + enabled                      = false
17:21:05.967 STDOUT terraform:       + entity_guid                  = (known after apply)
17:21:05.967 STDOUT terraform:       + id                           = (known after apply)
17:21:05.967 STDOUT terraform:       + name                         = "[Lambda API] Error count anomaly (Fuzzy attack)"
17:21:05.967 STDOUT terraform:       + policy_id                    = (known after apply)
17:21:05.967 STDOUT terraform:       + type                         = "baseline"
17:21:05.967 STDOUT terraform:       + violation_time_limit         = (known after apply)
17:21:05.967 STDOUT terraform:       + violation_time_limit_seconds = 86400
17:21:05.967 STDOUT terraform:       + critical {
17:21:05.967 STDOUT terraform:           + disable_health_status_reporting = false
17:21:05.967 STDOUT terraform:           + operator                        = "above"
17:21:05.967 STDOUT terraform:           + threshold                       = 8
17:21:05.967 STDOUT terraform:           + threshold_duration              = 300
17:21:05.967 STDOUT terraform:           + threshold_occurrences           = "all"
17:21:05.967 STDOUT terraform:         }
17:21:05.967 STDOUT terraform:       + nrql {
17:21:05.967 STDOUT terraform:           + data_account_id = (known after apply)
17:21:05.967 STDOUT terraform:           + query           = "SELECT count(*) FROM AwsLambdaInvocationError WHERE (`entityGuid`='MjY5MTk3NHxJTkZSQXxOQXw4OTUyNzY1NzE2MDc3MTExMjI5') AND `error.class` IN ('app.authentication.auth:AuthError', 'app.v2.errors:BadRequestError', 'werkzeug.exceptions:MethodNotAllowed')"
17:21:05.967 STDOUT terraform:         }
17:21:05.967 STDOUT terraform:       + warning {
17:21:05.967 STDOUT terraform:           + disable_health_status_reporting = false
17:21:05.967 STDOUT terraform:           + operator                        = "above"
17:21:05.967 STDOUT terraform:           + threshold                       = 5
17:21:05.967 STDOUT terraform:           + threshold_duration              = 300
17:21:05.967 STDOUT terraform:           + threshold_occurrences           = "all"
17:21:05.967 STDOUT terraform:         }
17:21:05.967 STDOUT terraform:     }
17:21:05.967 STDOUT terraform:   # newrelic_nrql_alert_condition.lambda_api_error_percentage_api_user_errors[0] will be created
17:21:05.967 STDOUT terraform:   + resource "newrelic_nrql_alert_condition" "lambda_api_error_percentage_api_user_errors" {
17:21:05.967 STDOUT terraform:       + account_id                     = (sensitive value)
17:21:05.967 STDOUT terraform:       + aggregation_delay              = "300"
17:21:05.967 STDOUT terraform:       + aggregation_method             = "event_flow"
17:21:05.967 STDOUT terraform:       + aggregation_window             = 60
17:21:05.967 STDOUT terraform:       + close_violations_on_expiration = true
17:21:05.967 STDOUT terraform:       + enabled                        = false
17:21:05.967 STDOUT terraform:       + entity_guid                    = (known after apply)
17:21:05.967 STDOUT terraform:       + expiration_duration            = 300
17:21:05.967 STDOUT terraform:       + id                             = (known after apply)
17:21:05.967 STDOUT terraform:       + name                           = "[Lambda API] Error percentage (API User Errors)"
17:21:05.967 STDOUT terraform:       + open_violation_on_expiration   = false
17:21:05.967 STDOUT terraform:       + policy_id                      = (known after apply)
17:21:05.968 STDOUT terraform:       + type                           = "static"
17:21:05.968 STDOUT terraform:       + violation_time_limit           = (known after apply)
17:21:05.968 STDOUT terraform:       + violation_time_limit_seconds   = 86400
17:21:05.968 STDOUT terraform:       + critical {
17:21:05.968 STDOUT terraform:           + disable_health_status_reporting = false
17:21:05.968 STDOUT terraform:           + operator                        = "above"
17:21:05.968 STDOUT terraform:           + threshold                       = 2
17:21:05.968 STDOUT terraform:           + threshold_duration              = 300
17:21:05.968 STDOUT terraform:           + threshold_occurrences           = "all"
17:21:05.968 STDOUT terraform:         }
17:21:05.968 STDOUT terraform:       + nrql {
17:21:05.968 STDOUT terraform:           + data_account_id = (known after apply)
17:21:05.968 STDOUT terraform:           + query           = "SELECT percentage(count(*), WHERE `error.class` IS NOT null)*100 / percentage(count(*), WHERE duration IS NOT null) as 'Error rate (%); filtered' FROM AwsLambdaInvocation, AwsLambdaInvocationError WHERE `entityGuid`='MjY5MTk3NHxJTkZSQXxOQXw4OTUyNzY1NzE2MDc3MTExMjI5' AND `error.class` IN ('jsonschema.exceptions:ValidationError', 'sqlalchemy.exc:NoResultFound')"
17:21:05.968 STDOUT terraform:         }
17:21:05.968 STDOUT terraform:       + warning {
17:21:05.968 STDOUT terraform:           + disable_health_status_reporting = false
17:21:05.968 STDOUT terraform:           + operator                        = "above"
17:21:05.968 STDOUT terraform:           + threshold                       = 1
17:21:05.968 STDOUT terraform:           + threshold_duration              = 300
17:21:05.968 STDOUT terraform:           + threshold_occurrences           = "all"
17:21:05.968 STDOUT terraform:         }
17:21:05.968 STDOUT terraform:     }
17:21:05.968 STDOUT terraform:   # newrelic_nrql_alert_condition.lambda_api_error_percentage_fuzzy_attack[0] will be created
17:21:05.968 STDOUT terraform:   + resource "newrelic_nrql_alert_condition" "lambda_api_error_percentage_fuzzy_attack" {
17:21:05.968 STDOUT terraform:       + account_id                     = (sensitive value)
17:21:05.968 STDOUT terraform:       + aggregation_delay              = "300"
17:21:05.968 STDOUT terraform:       + aggregation_method             = "event_flow"
17:21:05.968 STDOUT terraform:       + aggregation_window             = 60
17:21:05.968 STDOUT terraform:       + close_violations_on_expiration = true
17:21:05.968 STDOUT terraform:       + enabled                        = false
17:21:05.968 STDOUT terraform:       + entity_guid                    = (known after apply)
17:21:05.968 STDOUT terraform:       + expiration_duration            = 300
17:21:05.968 STDOUT terraform:       + id                             = (known after apply)
17:21:05.968 STDOUT terraform:       + name                           = "[Lambda API] Error percentage (Fuzzy attack)"
17:21:05.968 STDOUT terraform:       + open_violation_on_expiration   = false
17:21:05.968 STDOUT terraform:       + policy_id                      = (known...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
